<?php

return [
    'singular' => 'الفئه',
    'plural' => 'الفئات',
    'empty' => 'لا يوجد اخبار.',
    'count' => 'عدد الفئات',
    'search' => 'بحث',
    'select' => 'اختر الفئه',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن فئه',
    'total' => 'مجموع الفئات',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة فئه',
        'show' => 'عرض الفئه',
        'edit' => 'تعديل الفئه',
        'delete' => 'حذف الفئه',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الفئه بنجاح.',
        'updated' => 'تم تعديل الفئه بنجاح.',
        'deleted' => 'تم حذف الفئه بنجاح.',
        'cant_delete' => 'عذرًا، لا يمكن حذف الفئة التي تم حجزها بالفعل',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name' => 'اسم الفئه',
        '%name%' => 'اسم الفئه',
        'empty' => 'لا يوجد بيانات',
        'description' => 'محتوى الفئه',
        '%description%' => 'محتوى الفئه',
        'image' => 'صورة الفئه',
        'active' => 'تفعيل الفئه',
        'parent' => 'الفئه الرئيسيه',
        'status' => 'حاله الفئه',
        'subcategories' => 'الفئات الفرعية',
    ],
    'fields' => [
        'name' => 'اسم الفئه*',
        '%name%' => 'اسم الفئه*',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الفئه ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
