<?php

return [
    'singular' => 'الدولة',
    'plural' => 'الدول',
    'empty' => 'لا يوجد دول.',
    'count' => 'عدد الدول',
    'search' => 'بحث',
    'select' => 'اختر الدولة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن دولة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة دولة',
        'show' => 'عرض الدولة',
        'edit' => 'تعديل الدولة',
        'delete' => 'حذف الدولة',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الدولة بنجاح.',
        'updated' => 'تم تعديل الدولة بنجاح.',
        'deleted' => 'تم حذف الدولة بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name' => 'اسم الدولة',
        'currency' => 'العملة',
        'code' => 'كود الدولة',
        'key' => 'مفتاح الدولة',
        'flag' => 'صورة العلم',
        'is_default' => 'الافتراضية',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الدولة ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
